---
type: LeaderArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# LeaderArray

`Autodesk.Revit.DB.LeaderArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LeaderArray | — | `public LeaderArray ()` |
| Method | Append | — | `public virtual void Append ( Leader item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual LeaderArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Leader item , int index )` |
| Method | ReverseIterator | — | `public virtual LeaderArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Leader this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |